Repository: KACAH/WEB-Java-Project
Catalog: WJP-Resources/Lang.*.resx
Languages: lv

# AccountInfo
source: Account Information
lv: Lietotāja konta informācija

# ChangePassCompFail
source: The password and confirmation password do not match
lv: Parole un apstiprinājuma parole ir dažādas

# ChangePassConf
source: Confirm new password
lv: Paroles apstiprināšana

# ChangePassCurr
source: Current password
lv: Tekoša parole

# ChangePassLength
source: The Password must be at least 7 characters long
lv: Parolei jābūt vismaz 7 simbolu garai

# ChangePassNewPass
source: New password
lv: Jauna parole

# ChangePassReq
source: Minimum length of new password:
lv: Minimāls jaunas paroles garums ir:

# ChangePassSuc
source: Your password has been changed successfully.
lv: Parole veiksmīgi nomainīta.

# ChangePassUnsuc
source: Password change was unsuccessful. Please correct the errors and try again.
lv: Paroles maiņa bija neveiksmīga. Lūdzu izlabojiet kļūdas un meģiniet velreiz.

source: Change password
lv: Nomainīt paroli

# ChangePasswordFail
source: The current password is incorrect or the new password is invalid.
lv: Tekoša vai jauna parole ir nekorekta.

# DuplicateUserName
source: User name already exists. Please enter a different user name.
lv: Lietotājs ar tādu vārdu jau eksistē. Lūdzu izvelēties citu vārdu.

# IncorrectLoginOrPass
source: The user name or password provided is incorrect, or your account is blocked by administrator.
lv: Lietotāja vārds vai parole nav korrekti, vai jūsu lietotāja konte ir bloķēta.

# InvalidAnswer
source: The password retrieval answer provided is invalid. Please check the value and try again.
lv: Paroles atjaunošanas atbilde nav pareiza. Lūdzu izlabojiet to un meģiniet velreiz.

# InvalidEmail
source: The email address provided is invalid. Please check the value and try again.
lv: E-pasta adrese nav pareiza. Lūdzu izlabojiet to un meģiniet velreiz.

# InvalidPassword
source: The password provided is invalid. Please enter a valid password value.
lv: Parole nav pareiza. Lūdzu izlabojiet to un meģiniet velreiz.

# InvalidQuestion
source: The password retrieval question provided is invalid. Please check the value and try again.
lv: Paroles atjaunošana jautājums nav pareizs. Lūdzu izlabojiet to un meģiniet velreiz.

# InvalidUserName
source: The user name provided is invalid. Please check the value and try again.
lv: Ievadītais lietotāja vārds nav pareizs. Lūdzu izlabojiet to un meģiniet velreiz.

source: Log Off
lv: Iziet

source: Log On
lv: Ielogoties

# LogOnError
source: Error trying to log on into system!
lv: Kļūda, meģinot ielogoties sistemā!

# LogOnName
source: User name
lv: Lietotāja vārds

# LogOnPass
source: Password
lv: Parole

# LogOnRemember
source: Remember me?
lv: Atcereties mani?

# RegEmail
source: Email
lv: e-pasts

source: Register
lv: Reģistrēties

# RegUnsuc
source: Account creation was unsuccessful. Please correct the errors and try again.
lv: Konta izveidošana bija neveiksnīga. Lūdzu izlabojiet kļūdas un meģiniet velreiz.

# UnknownError
source: An unknown error occurred. Please verify your entry and try again. If the problem persists, please contact your system administrator.
lv: Radusies nezināmā kļūda. Lūdzu konaktejiet ar administrāciju.

# UserRejected
source: The user creation request has been canceled. Please verify your entry and try again. If the problem persists, please contact your system administrator.
lv: Konta izveidošana bija atcelta. Lūdzu konaktejiet ar administrāciju.

# LogInMess
source: You are logged in as
lv: Jūs esat sistemā kā

# Profile
source: User Profile
lv: Lietotāja konts

# ProfileProjects
source: My Projects
lv: Mani Projekti

source: Profile Settings
lv: Profila iestatījumi

# ProfileStats
source: Statistics
lv: Statistika

# UserNameLength
source: User Name must be at least 3 characters long
lv: Lietotāju vārdam jābūt vismaz 3 simbolu garam

source: Project name
lv: Projekta nosaukums

# ProjectNameLength
source: Project name must be at least 5 characters long
lv: Projekta nosaukumam jābūt vismaz 7 simbolu garam

source: Back
lv: Atpakāļ

# CompileDeprecation
source: Show deprecation
lv: Rādīt novecojušās funkcijas

# CompileDownload
source: Download Result
lv: Lējupielādēt rezultātu

# CompileEmail
source: Send to email
lv: Sūtīt uz ē-pastu

# CompileErrors
source: There were some errors during compilation, please check log.
lv: Kompilācijas laikā bija konstatētas kļūdas, lūdzu pārbaudiet logu.

# CompileResult
source: Compile
lv: Kompilēt

# CompileVersion
source: Java Compiler version
lv: Java kompilatora versija

# CompileWarnings
source: Show warnings
lv: Rādīt brīdinājumus

# EmailMessage
source: Email was sent. If you haven't got it, wait a few minutes, or your email adress was incorrect, or our site is wrong ((
lv: Ē-pasts ir nosūtīts. Ja jūs to nesaņēmat, pagaidiet dažas minūtes, vai jūs noradījāt nepareizu ē-pasta adresi, vai mūsu resurss nestrādā ((

# HomeWelcome
source: This is Java online project system. You can create compile your Java projects here. Also you can do bla-bla-bla...
lv: Tas ir online Java projektēšanas sistēma. Šeit jūs varat izveidot jaunus, rediģēt un kompilēt jūsu Java projektus.

source: Info
lv: Informācija

# ProjectAddUser1
source: Add User
lv: Pievienot lietotāju

# ProjectAddUser2
source: to my project.
lv: manam projektam.

# ProjectAddUserToProject
source: Add this user to my project
lv: Pievienot šo lietotāju manam projektam

# ProjectAllowed
source: My related projects
lv: Projekti ar mani

# ProjectBlockUser
source: Block user
lv: Blokēt lietotāju

# ProjectChooseYourProject
source: Choose your project
lv: Izvelēties jūsu projektu

# ProjectClosed
source: Closed
lv: Aizverts

# ProjectCompile
source: Compile
lv: Kompilēt

# ProjectCreatedNumber
source: Number of created projects
lv: Izveidoto projektu skaits

# ProjectCreateProject
source: Create project
lv: Izveidot projektu

# ProjectData
source: Data files
lv: Datu faili

# ProjectExit
source: Exit
lv: Iziet

# ProjectFileCreatedBy
source: Created by
lv: Izveidotājs

# ProjectFileCreatedDate
source: Creation date
lv: Izveidošanas datums

# ProjectFileDelete
source: Delete
lv: Dzēst

# ProjectFileDownload
source: Download
lv: Lējupielādēt

# ProjectFileEdit
source: Edit
lv: Redigēt

# ProjectFileModifiedBy
source: Modified by
lv: Izmainīja

# ProjectFileModifiedDate
source: Modified date
lv: Izmaiņu datums

# ProjectFileName
source: File name
lv: Faila vārds

# ProjectFilesAdded
source: Files added
lv: Pievienot failus

# ProjectFileUpload
source: Upload new
lv: Augsupielādēt jaunu

# ProjectFindProjects
source: Find projects
lv: Atrast projektu

# ProjectFindUsers
source: Find users
lv: Atrast lietotāju

# ProjectGeneral
source: General
lv: Galvenā

# ProjectJoinedNumber
source: Number of joined projects
lv: Pievienoto projektu skaits

# ProjectLastChanges
source: Last changes
lv: Pedējās izmaiņas

# ProjectLastProject
source: Last project
lv: Pedējais projekts

# ProjectLibrary
source: Library files
lv: Bibliotēku faili

# ProjectOwn
source: My own projects
lv: Mani projekti

# ProjectProject
source: Project
lv: Projekts

# ProjectSource
source: Source files
lv: Pirmkoda faili

# ProjectUnblockUser
source: Unblock user
lv: Atblokēt lietotāju

source: Save changes
lv: Saglabāt izmaiņas

source: Change email
lv: Mainī ē-pasta adresi

# ChangeEmailSuc
source: Change email succesfull!
lv: Ē-pasta adrese veiksmīgi nomainīta!
